{
    "basics": {
        "name": "Joshua Hutt",
        "label": "Technical Writer, Software Developer",
        "picture": "http://www.gravatar.com/avatar/f12264dd60439474861eb588f5472bac?s=500.png",
        "email": "joshua@huttj.com",
        "phone": "(206) 486-4807",
        "website": "http://joshuahutt.com",
        "summary": "",
        "location": {
            "address": "1800 S Jackson St #203",
            "postalCode": "WA 98144",
            "city": "Seattle",
            "countryCode": "US",
            "region": "Washington"
        },
        "profiles": [
            {
                "network": "GitHub",
                "username": "huttj",
                "url": "https://github.com/huttj/"
            },
            {
                "network": "LinkedIn",
                "username": "169900357",
                "url": "https://www.linkedin.com/profile/view?id=169900357"
            },
            {
                "network": "Twitter",
                "username": "joshuahutt",
                "url": "https://twitter.com/joshuahutt"
            }
        ]
    },
    "work": [
        {
            "company": "Avanade",
            "position": "User Assistance Lead",
            "website": "http://www.avanade.com",
            "startDate": "2013-04-01",
            "endDate": "Present",
            "summary": "Avanade is a business technology solutions and managed services provider with innovative insights and expertise in Microsoft technologies that helps customers realize results.",
            "highlights": [
                "Working closely with Technology Infrastructure (TI) developers, business consultants, product managers, and key product stakeholders to research and document enterprise requirements, user-stories, and product features, integrating the results into a core project methodology.",
                "Participating in software re-architecture planning: validating database schemas, user requirements, and business processes in the context of the in-progress project methodology, as well as moderating the feature-methodology interaction",
                "Working with the Software & Cloud Services (SCS) UX Working Group; developing a UX Design Pattern Library in SharePoint 2010 and KnockoutJS to capture internal UX patterns and offer SCS development teams a central, user-friendly repository for repeatable code and best practices.",
                "Producing adaptive, user-centered HTML5 help and PowerPoint training decks to define and simplify complex user workflows.",
                "Taking ownership of the entire library of end-user and business consultant documentation for an enterprise software platform with a diverse customer base, including installation guides, user guides, customer demonstration guides, and UI documentation.",
                "Working with a senior Technical Writer to develop a new, iterative strategy for company-wide software documentation."
            ]
        },
        {
            "company": "University of Washington",
            "position": "Assistant Technical Writer",
            "website": "http://www.ee.washington.edu",
            "startDate": "2011-01",
            "endDate": "2013-03",
            "summary": "During my last two years at school, I worked for professor Alexander Mamishev in the Electrical Engineering department.",
            "highlights": [
                "Writing, editing, and publishing multi-million dollar research proposals, technical journal articles, Ph.D. dissertations, press releases, news articles, and three non-fiction books, including a Microsoft Word 2010 instructional book.",
                {
                    "value": "Leading public relations efforts at the Sensors, Energy, and Automation Laboratory (SEAL), including:",
                    "data": [
                        "Writing and disseminating SEAL-branded press releases based on successful research, articles, and grants;",
                        "Drafting publicity articles for SEAL research and the STREAM Tools System;",
                        "Analyzing potential target news outlets and organizations in the PNW and reaching out through cold-calling",
                        "Arranging book publication and a corresponding author event at the UW’s University Book Store;",
                        "Securing and coordinating a KING 5 TV news segment for the Dietary Data Recording System developed at SEAL"
                    ]
                },
                "Creating a business plan, a marketing plan, and various products for the STREAM Tools business venture.",
                "Adapting data from technical publications to create PowerPoint presentations, wall posters, and book manuscripts.",
                "Updating, redesigning, and maintaining the SEAL website, including a creating a lightweight, PHP-based framework."
            ]
        },
        {
            "company": "Real Sort",
            "position": "Web Designer & Business Consultant",
            "website": "http://www.realsort.org",
            "startDate": "2012-06",
            "endDate": "2012-07",
            "summary": "Real Sort offers an alternative to the standard professional organizing experience.",
            "highlights": [
                "Worked with the customer to identify branding requirements and develop a unique and personal brand positioning.",
                "Redesigned the visual elements of the customer’s website to complement established branding and meet customer expectations.",
                "Created additional custom-branded physical documents, including business cards, customer intake forms, and questionnaires.",
                "Worked with the customer to develop and revise a business plan, marketing materials, and a three-tiered service offering."
            ]
        },
        {
            "company": "Minhang High School (China)",
            "position": "High School English Teacher",
            "website": "http://mhzx.mhedu.sh.cn/",
            "startDate": "2010-12",
            "endDate": "2010-09",
            "summary": "",
            "highlights": [
                "Designed and delivered practical curricula and teaching plans for five classes of varying levels of English proficiency.",
                "Incorporated material from internet research, popular teaching manuals, and previous experience into lesson plans."
            ]
        },
        {
            "company": "University of Washington",
            "position": "Nanotech Research Assistant",
            "website": "http://depts.washington.edu/nlab/",
            "startDate": "2009-11",
            "endDate": "2010-06",
            "summary": "",
            "highlights": [
                "Researched current developments in fluid dynamics, wrote article summaries, and provided citations for journal articles.",
                "Performed laboratory experiments and data analysis; created, revised, and documented methods as needed.",
                "Participated in weekly meetings, prepared and presented detailed reports, and maintained strict confidentiality."
            ]
        },
        {
            "company": "Self-Employed",
            "position": "Independent Landscaper",
            "location": "Port Townsend, WA",
            "website": "",
            "startDate": "2009-08",
            "endDate": "2010-06",
            "summary": "For the two summers after I returned from China, and during the weekends when I could return home, I ran a landscaping business in Port Townsend, WA.",
            "highlights": [
                "Advertised through persuasive newspaper ads, strategically placed signage along high-traffic routes, and personal networking.",
                "Built and maintained a steady a network of clientele, regularly negotiating rate increases of up to 50%.",
                "Provided and revised estimates, tested and revised service offerings, and selectively included sub-contracts as needed."
            ]
        },
        {
            "company": "Bailey-Boushay House",
            "position": "Carlson Civic Fellow",
            "website": "http://www.bailey-boushay.org/",
            "startDate": "2008-01",
            "endDate": "2008-06",
            "summary": "The Bailey-Boushay House provides exceptional care to people with HIV disease, promoting their health, well-being and functional independence.",
            "highlights": [
                "Redesigned the volunteer intake process at the facility from the ground up, which included developing a clear flowchart-guided process, a document management system, and support documentation for new and existing managers.",
                "Oversaw office administration and devised and implemented a filing system to reduce a persistent backlog of paperwork."
            ]
        }

    ],
    "volunteer": [
        {
            "organization": "Chinese Information and Service Center",
            "position": "English Tutor",
            "website": "http://cisc-seattle.org/",
            "startDate": "2010-01",
            "endDate": "2010-06",
            "summary": "CISC helps Chinese and other Asian immigrants throughout King County achieve success in their new community by providing information, referral, advocacy, social, and support services.",
            "highlights": [
                "Taught elderly patrons of the Sunshine Garden Senior Day-Care, working with bilingual students to teach native speakers of Cantonese.",
                "Prepared lessons from stories found online and from personal experience.",
                "Organized and led annual tour group to the University of Washington."
            ]
        }
    ],
    "education": [
        {
            "institution": "Self-Study",
            "area": "Business, Software Development, and Web Design",
            "studyType": "",
            "startDate": "2013-03-01",
            "endDate": "Present",
            "courses": [
                "AngularJS",
                "Cordova/PhoneGap",
                "Ionic Framework",
                "NodeJS",
                "Business Analysis",
                "Consulting",
                "SQL Server 2012"
            ]
        },
        {
            "institution": "University of Washington",
            "area": "International Studies, Minors in Math and Applied Math",
            "studyType": "BA",
            "startDate": "2007-09-26",
            "endDate": "2013-03-01",
            "gpa": "3.56",
            "courses": [
                "Chinese (I-IV)",
                "Java programming (I & II)",
                "Scientific Computing",
                "Technical Communication",
                "Statistics",
                "Linear Algebra",
                "Calculus (I, II, & III)",
                "Calculus of Complex Variables"
            ],
            "highlights": [
                "Conducted contingent valuation surveys and environmental research in two of China’s most polluted cities.",
                "Audited Entrepreneurship class (ENTRE 540) at the Foster School of Business.",
                "Named on Dean’s List for outstanding study, both at the UW (2012) and at Sichuan University (2010).",
                "Worked in the University Machine Shop (2010) and conducted Nanofluidics (2009-10) and Cilia experiments (2007-08)."
            ]
        }
    ],
    "awards": [
        {
            "title": "",
            "date": "",
            "awarder": "",
            "summary": ""
        }
    ],
    "publications": [
        {
            "name": "",
            "publisher": "",
            "releaseDate": "2014-10-01",
            "website": "",
            "summary": ""
        }
    ],
    "skills": [
        {
            "name": "Web Development",
            "level": "7",
            "keywords": [
                "HTML, CSS, JavaScript",
                "NodeJS, SocketIO, Flask",
                "Angular, Knockout, Ionic",
                "T-SQL, PostgreSQL, MySQL"
            ]
        },
        {
            "name": "Technical Writing",
            "level": "7",
            "keywords": [
                "Microsoft Word",
                "MadCap Flare",
                "Editing",
                "Proofreading",
                "Information Architecture"
            ]
        },
        {
            "name": "Teaching",
            "level": "5",
            "keywords": [
                "One-on-one training",
                "Web-based training",
                "Developing training materials",
                "Business training"
            ]
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        },
        {
            "language": "Mandarin Chinese",
            "fluency": "Advanced"
        }
    ],
    "interests": [
        {
            "name": "Reading"
        },
        {
            "name": "Weight Training"
        }
    ],
    "references": [
        {
            "name": "",
            "reference": ""
        }
    ]
}
