{
  "basics": {
    "name": "Joshua Hutt",
    "label": "Entrepreneur, Software Developer",
    "picture": "http://www.gravatar.com/avatar/f12264dd60439474861eb588f5472bac?s=512.png",
    "email": "joshua@huttj.com",
    "phone": "(206) 486-4807",
    "website": "http://joshuahutt.com",
    "profiles": [
      {
        "network": "GitHub",
        "username": "huttj",
        "url": "https://github.com/huttj"
      },
      {
        "network": "LinkedIn",
        "username": "169900357",
        "url": "https://www.linkedin.com/profile/view?id=169900357"
      },
      {
        "network": "Twitter",
        "username": "joshuahutt",
        "url": "https://twitter.com/joshuahutt"
      }
    ]
  },
  "work": [
    {
      "company": "Elevāt",
      "position": "Senior Software Developer",
      "website": "https://www.elevat-iot.com",
      "startDate": "2017-11-06",
      "endDate": "2018-04-18",
      "summary": "Elevāt provides a complete lifecycle management solution for intelligent assets. It helps customers listen to their devices, make sense of all the chatter, and build insights that enable the best business decisions possible.",
      "highlights": [
        "Working with a small team of four other developers to scale an add critical features to a real-time IoT data collection and analysis platform on built on AWS, with Node.js and AngularJS.",
        "Building a drop-in replacement for the AWS IoT Device Shadow service to dramatically improve performance and initial load time using a Redis cluster, and to offer improved, granular control over data seeding and caching on the signal, device, and organization levels.",
        "Building a rules engine and associated UI to enable the company to close a growing segment of prospective customers who need to monitor and react to device measurements in near real-time, thereby improving their visibility and insight into what’s happening in the field, and facilitating preventative maintenance and iterative efficiency tuning.",
        "Streamlining the development and deployment cycle with Terraform, CI/CD integrations between GitHub and Shippable, and advocating for and instructing on best practices in Git and Gitflow.",
        "Migrating unit tests to use Jest, improving testing speed and reliability, and making writing and maintaining tests easier on the developer."
      ]
    },
    {
      "company": "Stackline",
      "position": "Senior Software Developer",
      "website": "https://www.stackline.com/",
      "startDate": "2017-07-31",
      "endDate": "2017-09-25",
      "summary": "Stackline transforms how brands manage online retail by providing mission critical tools for e-commerce.",
      "highlights": [
        "Worked independently alongside a small, three-person team of backend developers to build a Vendor Data Collection service for retailer websites, to position Stackline as the single-source of truth for all customer sales data. The Node.js service logs in to vendor websites and (1) runs, (2) pulls, (3) transforms, and (4) loads sales and inventory reports. It was built on AWS ECS/EC2, Lambda, S3, SQS, and SNS, to provide a scalable and fault-tolerant solution with real-time status reporting in Slack.",
        "Built a Desktop Data Collector for running the vendor data collection process from the customer's own hardware, eliminating the need for sharing login credentials with clients, thus eliminating a significant hurdle for some prominent customers. Developed with Electron/Node.js, React, and Webpack, it includes a UI for account management and job monitoring, as well as a 'headless Chrome' API integrated into Electron for orchestrating the report collection process."
      ]
    },
    {
      "company": "PushPay",
      "position": "Senior Software Developer",
      "website": "http://www.pushpay.com",
      "startDate": "2017-02-13",
      "endDate": "2017-07-31",
      "summary": "Pushpay improves sales and business processes by making payments simple.",
      "highlights": [
        "Joined as the first US developer on the eChurch platform, interfacing with a small team of developers based out of the original New Zealand headquarters to maintain and enhance a powerful mobile app content management and delivery platform, built in Node.js, React, and React Native.",
        "Integrated much-needed metrics collection into the platform, using StatsD and Librato, to provide insight into customer and end-user usage patterns, as well as into server performance and irregularities, enabling the support team to more effectively work with customers to get the most out of the platform, and enabling the development team to identify and eliminate performance bottlenecks.",
        "Automated screenshot collection for apps designed on the platform, to save a tremendous amount of time spent by (very grateful) implementation specialists (on what was their lengthiest and most repetitive task), reducing the overall time to onboard new customers.",
        "Developed UI/UX improvements to improve the customer experience throughout the platform and reduce the number of support requests received by the support team."
      ]
    },
    {
      "company": "Maxsam Partners (CashMap)",
      "position": "Principal Engineer (Contract)",
      "website": "http://www.maxsampartners.com",
      "startDate": "2017-03-01",
      "endDate": "2017-06-01",
      "summary": "Maxsam Partners is a technology and leadership consultancy focused on assisting high-growth companies with their sales and development needs.",
      "highlights": [
        "Developed a complex, cross-platform mobile application with over 45 detailed screens and multiple dynamic formulae based on optional data entered throughout the app, using ES6, with React Native and Redux.",
        "Redesigned existing screens and functionality from the original iPad app to suit the phone form factor, introducing new levels of interactivity and instant feedback (e.g., earnings and interest graphs update as sliders are dragged) to improve the user experience.",
        "Integrated in-app purchases (one-time purchases) and in-app subscriptions via the Apple App Store unlocking premium content throughout the app’s various reports."
      ]
    },
    {
      "company": "GrindLogPro",
      "position": "Lead Mobile Developer (Contract)",
      "website": "http://www.grindlogpro.com",
      "startDate": "2016-11-01",
      "endDate": "2017-05-01",
      "summary": "Grind Log Pro is an easy and efficient tool for logging meat grinds and generating grind log reports based on the 2016 USDA protocol. ",
      "highlights": [
        "Designed a mobile UI in an extremely short (one-week) timeframe, for the existing Grind Log Pro web app – a fast and flexible tool to help grocery stores maintain compliance with the USDA regulations in a reliable, convenient, and consistent manner.",
        "Significantly hardened the existing app through upgrades and bug fixes; added defensive error handling, improved app security, integrated real-time, Slack-integrated application logs, and upgraded the login flow for mobile.",
        "Streamlined the barcode scanning process with the inclusion of a real-time scanning feature to quickly and easily scan grind barcodes and enter the data into the app.",
        "Handled the publication and update processes on both the Apple App Store and the Google Play Store."
      ]
    },
    {
      "company": "Maxsam Partners (Apple LG)",
      "position": "Senior Software Developer (Contract)",
      "website": "http://www.maxsampartners.com",
      "startDate": "2016-02-01",
      "endDate": "2017-01-01",
      "summary": "Maxsam Partners is a technology and leadership consultancy focused on assisting high-growth companies with their sales and development needs.",
      "highlights": [
        "Worked on a two-person team to design and develop user-friendly, and reusable front-end components in Adobe’s unique AEM (Adobe Experience Manager) platform, using Angular 1 and Sightly, for ongoing use by marketing personnel and other non-developers.",
        "Automated the production of over 200 marketing pages for the rollout of a high-SEO marketing site on the AEM platform, avoiding both costly scope creep and the scrapping of any part of the planned delivery, instead making it possible to build and deliver the full site on time and within budget.",
        "Produced multiple landing experiences for the project that secured a lucrative advertising deal with American Express."
      ]
    },
    {
      "company": "Cadence",
      "position": "Senior Front-End Developer (Contract)",
      "website": "https://www.cadencetranslate.com",
      "startDate": "2016-04-01",
      "endDate": "2016-06-01",
      "summary": "Cadence is a leading provider of language services to the global business and investment community, and an innovator in real-time translation technology.",
      "highlights": [
        "Worked independently to redesign the user intake form in ReactJS, to vastly improve the form integration with the rest of the application, making it easier and more inviting for new customers to sign up and onboard quickly. Also included helpful widgets and tools to improve the UX, and integrated the form with Cadence’s \"smart-match\" technology on the backend.",
        "Dramatically redesigned the landing page to showcase the flexibility and technical sophistication of the platform, updated the site’s color scheme, and improved the look and feel of the all of the site’s pages on mobile.",
        "Integrated Intercom chat into the ReactJS application and the team’s Slack group, to improve the customer experience from the first visit, and to enable the support team to shepherd new customers during the signup process and through their first engagement."
      ]
    },
    {
      "company": "Galvanize",
      "position": "Workshop Instructor (Contract)",
      "website": "http://www.galvanize.com",
      "startDate": "2016-04-18",
      "endDate": "2016-09-01",
      "summary": "Galvanize is a technology school and co-working space that provides entrepreneurs and learners with life-changing opportunities for growth.",
      "highlights": [
        "Independently taught an introductory JavaScript class and coached ten students of diverse backgrounds and technical experience in the basics of HTML, CSS, and JavaScript, in just eight short weeks.",
        "Emphasized the importance of solving the right problem, design-first approaches, and writing clean code, preparing many of the students for strong success in the full six-month Galvanize course. Many of the students have since successfully entered the software industry.",
        "Coached the students through various homework projects, including a student-driven final project, for which most of the students produced sophisticated and beautifully-designed applications, including a Yelp-integrated coffee shop locator, a tide pool map for kindergarten instruction, and an animated card-matching game."
      ]
    },
    {
      "company": "Maxsam Partners (TrueBlue)",
      "position": "Senior Software Developer (Contract)",
      "website": "http://www.maxsampartners.com",
      "startDate": "2016-02-01",
      "endDate": "2017-01-01",
      "summary": "Maxsam Partners is a technology and leadership consultancy focused on assisting high-growth companies with their sales and development needs.",
      "highlights": [
        "Worked in an enterprise environment on a mixed team of contractors and FTEs to redesign a integration layer for a third-party vendor.",
        "Designed and implemented a scalable, serverless application architecture for replication and transformation of data from a SQL Server instance to DynamoDB, and near real-time publication of updates, using AWS Lambda, S3, SNS, SQS, and API Gateway.",
        "Implemented symmetric at-rest encryption for data in DynamoDB and SQS, using C#, Node.js, and Amazon’s Key Management Service.",
        "Developed and maintained high-throughput, multi-threaded Windows services with .NET in C# for monitoring SQL Server Service Broker queues and uploading data updates to DynamoDB continuously.",
        "Delivered training to 25+ mid- and senior-level client personnel on AWS managed services and the solution architecture.",
        "Drove cross-disciplinary collaboration on a fast-paced, agile Scrum team of developers, testers, and managers.",
        "Mentored and assisted other developers with code reviews, pair programming, and general development advice.",
        "Implemented and maintained end-to-end performance monitoring solution with the ELK stack (Elasticsearch, Logstash, and Kibana), to monitor system health and performance with high-level charts and statistics as well and detailed event-level logs."
      ]
    },
    {
      "company": "Gesto Technologies",
      "position": "Software Developer",
      "website": "http://www.gestotech.com",
      "startDate": "2015-11-02",
      "endDate": "2016-01-31",
      "summary": "Gesto Technologies provides an all-in-one point-of-sale and loyalty platform for businesses in the hospitality, gaming, sports, and retail industries.",
      "highlights": [
        "Singlehandedly designed and developed an extensible promotions service to serve as the foundation for customer engagement on the platform. The service including a DSL for defining promotions, an efficient algorithm for optimizing the application of available promotions to orders, and an attractive admin interface for managing promotions.",
        "Worked with a distributed team to triage and resolve bugs, production issues, and customer support requests, during on-call rotation.",
        "Designed and developed a menu management tool in Angular, Express, and MongoDB, to improve the user experience of customer menu management, and to preserve the integrity of the menu data during updates."
      ]
    },
    {
      "company": "Avanade",
      "position": "User Assistance Lead",
      "website": "http://www.avanade.com",
      "startDate": "2013-04-01",
      "endDate": "2015-10-31",
      "summary": "Avanade is a business technology solutions and managed services provider with innovative insights and expertise in Microsoft technologies that helps customers realize results.",
      "highlights": [
        "Designed and developed UX-driven features for a large enterprise .NET MVC application written in C#, including user-requested status monitoring elements, page-level integration of detailed, high-quality context-sensitive help (CSH), and detailed form tooltips.",
        "Developed and maintained a UX Design Pattern Library with SharePoint 2010, Bootstrap, jQuery, and Knockout.js to offer internal development teams a central, user-friendly repository for repeatable code and best practices.",
        "Produced responsive, user-centered HTML5 help and PowerPoint training decks to simplify complex user workflows.",
        "Worked with a senior Technical Writer to develop a department-wide framework for technical documentation.",
        "Facilitated software re-architecture by validating database schemas, user requirements, and business processes in the context of the in-progress methodology, and developing artifacts to codify the feature-methodology interplay.",
        "Took ownership of the entire library of end-user and business consultant documentation for an enterprise software platform with a diverse customer base, in order to ensure a consistent, high-quality experience.",
        "Scripted, recorded, and edited a video training series for consultants and end-users of the software platform."
      ]
    },
    {
      "company": "University of Washington",
      "position": "Technical Writer",
      "website": "http://www.ee.washington.edu",
      "startDate": "2011-01",
      "endDate": "2013-03",
      "summary": "During my last two years at school, I worked for professor Alexander Mamishev in the Electrical Engineering department.",
      "highlights": [
        "Redesigned and maintained the website for the Sensors, Energy, and Automation Laboratory (SEAL), creating a light-weight, flat-file framework in PHP, styled with adaptive and mobile-friendly CSS.",
        "Wrote and published press releases and news articles, wrote a Microsoft Word 2010 instructional book, edited multi-million dollar research proposals, technical journal articles, and Ph.D. dissertations, and edited two non-fiction books.",
        "Led public relations efforts, including drafting publicity articles, arranging book publication and an author event at the UW, and securing and coordinating a KING 5 TV news segment for the Dietary Data Recording System.",
        "Created a business plan, a marketing plan, and various products for the STREAM Tools business venture."
      ]
    },
    {
      "company": "Real Sort",
      "position": "Web Designer & Business Consultant",
      "website": "http://www.realsort.org",
      "startDate": "2012-06",
      "endDate": "2012-07",
      "summary": "Real Sort offers an alternative to the standard professional organizing experience.",
      "highlights": [
        "Worked with the customer to identify branding requirements and develop a unique and personal brand positioning.",
        "Redesigned the visual elements of the customer’s website to complement established branding and meet customer expectations.",
        "Created additional custom-branded physical documents, including business cards, customer intake forms, and questionnaires.",
        "Worked with the customer to develop and revise a business plan, marketing materials, and a three-tier service offering."
      ]
    },
    {
      "company": "Minhang High School (China)",
      "position": "High School English Teacher",
      "website": "http://mhzx.mhedu.sh.cn/",
      "startDate": "2010-12",
      "endDate": "2010-09",
      "summary": "",
      "highlights": [
        "Designed and delivered practical curricula and teaching plans for five classes of varying levels of English proficiency.",
        "Incorporated material from internet research, popular teaching manuals, and previous experience into lesson plans."
      ]
    },
    {
      "company": "University of Washington",
      "position": "Nanotech Research Assistant",
      "website": "http://depts.washington.edu/nlab/",
      "startDate": "2009-11",
      "endDate": "2010-06",
      "summary": "Dr. Chung's Nanomanufacturing Laboratory is focused on \"nanoengineering for low-cost, rapid diagnosis of diseases.\"",
      "highlights": [
        "Performed laboratory experiments and data analysis; created, revised, and documented methods as needed.",
        "Created experimental apparatus in the University's Machine Shop, according to SolidWorks models and blueprints.",
        "Researched current developments in fluid dynamics, wrote article summaries, and provided citations for journal articles.",
        "Participated in weekly meetings, prepared and presented detailed reports, and maintained strict confidentiality."
      ]
    },
    {
      "company": "Self-Employed",
      "position": "Independent Landscaper",
      "location": "Port Townsend, WA",
      "website": "",
      "startDate": "2009-08",
      "endDate": "2010-06",
      "summary": "For the two summers after I returned from China, and during the weekends when I could return home, I ran a landscaping business in Port Townsend, WA.",
      "highlights": [
        "Advertised through persuasive newspaper ads, strategically placed signage along high-traffic routes, and personal networking.",
        "Built and maintained a steady network of clientele, regularly negotiating rate increases of up to 50%.",
        "Provided and revised estimates, tested and revised service offerings, and selectively included sub-contracts as needed."
      ]
    },
    {
      "company": "Bailey-Boushay House",
      "position": "Carlson Civic Fellow",
      "website": "http://www.bailey-boushay.org/",
      "startDate": "2008-01",
      "endDate": "2008-06",
      "summary": "The Bailey-Boushay House provides exceptional care to people with HIV disease, promoting their health, well-being and functional independence.",
      "highlights": [
        "Redesigned the volunteer intake process at the facility from the ground up, which included developing a clear flowchart-guided process, a document management system, and support documentation for new and existing managers.",
        "Oversaw office administration and devised and implemented a filing system to reduce a persistent backlog of paperwork.",
        "Assisted in meal prep and delivery for visitors and residents."
      ]
    }
  ],
  "sideProjects": [
    {
      "company": "Sympathize",
      "position": "Lead Developer",
      "website": "",
      "startDate": "2018-02-01",
      "endDate": "Present",
      "summary": "",
      "highlights": [
        "Designing and developing a real-time chat application to connect users to discuss issues they face and offer support and to one another."
      ]
    },
    {
      "company": "GottaGoGov",
      "position": "Lead Developer",
      "website": "http://www.gottagogov.com",
      "startDate": "2016-09-01",
      "endDate": "Present",
      "summary": "GottaGoGov is a travel planning tool for travelers that follow GSA and State Department travel policy.",
      "highlights": [
        "Designing and developing an offline-first mobile application for travelers that follow federal and state government travel rules.",
        "Developing multiple features that improve on the (dated) existing applications on the app stores, including: Per-diem comparison to help travelers identify the best rates in an area; Nearby flights to identify travel options; Airline preferences to highlight flights that will earn frequent flier points; A simple search mechanism to find flights and per-diem rates for any city; Travel time selection, to simplify the process by only showing the relevant data."
      ]
    },
    {
      "company": "Cerca LLC",
      "position": "Lead Developer",
      "website": "http://www.getcerca.com",
      "startDate": "2014-11-01",
      "endDate": "2015-10-01",
      "summary": "Cerca is realtime, location-based mobile app built to help friends get together.",
      "highlights": [
        "Designing and developing a real-time mobile application, with Ionic, Node, and PostgreSQL, deploying to AWS.",
        "Supporting, mentoring, and teaching a junior developer in the areas of system design and architecture, JavaScript gotchas and best practices, as well as feature design, scoping, and implementation.",
        "Researching, learning, and adopting new technologies whenever possible.",
        "Researching user experience, and troubleshooting and resolving errors identified by user feedback.",
        "Setting delivery dates, prioritizing development tasks, and deploying to the app stores on a regular cadence."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Seattle JS Hackers",
      "position": "Organizer",
      "website": "http://seattlejshackers.com",
      "startDate": "2016-03",
      "endDate": "Present",
      "summary": "Seattle JS Hackers is an open and inclusive after-hours community of JavaScript hackers who learn and hack in JavaScript together.",
      "highlights": [
        "Organizing and hosting events at various locations in Seattle, including the most popular coding schools.",
        "Mentoring new learners of JavaScript, offering advice, feedback, and resources to aid in their advancement.",
        "Facilitating project ideation and collaboration among fellow JS Hackers.",
        "Offering resume feedback, interview tips and techniques, and overall career guidance to junior developers looking to break into the field."
      ]
    },
    {
      "organization": "NodeSchool",
      "position": "JavaScript Mentor",
      "website": "http://nodeschool.io/",
      "startDate": "2015-05",
      "endDate": "Present",
      "summary": "NodeSchool is an open source project run by volunteers with two goals: to create high quality programming curriculum and to host community learning events.",
      "highlights": [
        "Teaching and mentoring budding programmers of various levels of development.",
        "Sharing information about the workshops and programs with potential students and mentors."
      ]
    },
    {
      "organization": "Chinese Information and Service Center",
      "position": "English Tutor",
      "website": "http://cisc-seattle.org/",
      "startDate": "2010-01",
      "endDate": "2010-06",
      "summary": "CISC helps Chinese and other Asian immigrants throughout King County achieve success in their new community by providing information, referral, advocacy, social, and support services.",
      "highlights": [
        "Taught elderly patrons of the Sunshine Garden Senior Day-Care, working with bilingual students to teach native speakers of Cantonese.",
        "Prepared lessons from stories found online and from personal experience.",
        "Organized and led annual tour group to the University of Washington."
      ]
    }
  ],
  "education": [
    {
      "institution": "Self-Study",
      "area": "Business, Software Development, and Web Design",
      "studyType": "",
      "startDate": "2013-03-01",
      "endDate": "Present",
      "courses": [
        "System Architecture",
        "Marketing",
        "React Native",
        "React",
        "MEAN.js",
        "Meteor",
        "Angular",
        "Cordova/PhoneGap",
        "Ionic Framework",
        "Node.js",
        "Business Analysis",
        "Consulting",
        "SQL"
      ]
    },
    {
      "institution": "University of Washington",
      "area": "International Studies, Minors in Math and Applied Math",
      "studyType": "BA",
      "startDate": "2007-09-26",
      "endDate": "2013-03-01",
      "gpa": "3.56",
      "courses": [
        "Chinese (I-IV)",
        "Java programming (I & II)",
        "Scientific Computing",
        "Technical Communication",
        "Statistics",
        "Linear Algebra",
        "Calculus (I, II, & III)",
        "Calculus of Complex Variables",
        "Leadership Development"
      ],
      "highlights": [
        "Conducted contingent valuation surveys and environmental research in two of China’s most polluted cities.",
        "Audited Entrepreneurship class (ENTRE 540) at the Foster School of Business.",
        "Named on Dean’s List for outstanding study, both at the UW (2012) and at Sichuan University (2010).",
        "Worked in the University Machine Shop (2010) and conducted Nanofluidics (2009-10) and Cilia experiments (2007-08)."
      ]
    }
  ],
  "awards": [
    {
      "title": "",
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "publications": [
    {
      "name": "",
      "publisher": "",
      "releaseDate": "2014-10-01",
      "website": "",
      "summary": ""
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "8",
      "keywords": [
        "HTML, CSS, JavaScript",
        "NodeJS, SocketIO, Meteor",
        "Angular, Ionic, Knockout",
        "PostgreSQL, T-SQL, MySQL",
        "RethinkDB, MongoDB, Redis"
      ]
    },
    {
      "name": "Technical Writing",
      "level": "7",
      "keywords": [
        "Microsoft Word",
        "MadCap Flare",
        "Editing",
        "Proofreading",
        "Information Architecture"
      ]
    },
    {
      "name": "Teaching",
      "level": "6",
      "keywords": [
        "One-on-one training",
        "Web-based training",
        "Developing training materials",
        "Junior developer mentoring",
        "Entrepreneurial and business mentoring"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Mandarin Chinese",
      "fluency": "Advanced"
    }
  ],
  "interests": [
    {
      "name": "Reading"
    },
    {
      "name": "Weight Training"
    }
  ],
  "references": [
    {
      "name": "",
      "reference": ""
    }
  ]
}
